[{"name": "Proxmox Azure OID", "date": "17.2.2023", "author": "admin", "url": "https://blog.iservery.com/2023/02/17/proxmox-azure-oid/", "content": "\nProxmox OIDC Authentication Azure AD\n\nZdroj\nhttps://www.reddit.com/r/Proxmox/comments/pqxu2o/proxmox_oidc_authentication_azure_ad/\nDobrý den, nedávno jsem upgradoval svůj Proxmox Server na 7.0 a tím jsem získal nový autentizační mechanismus OIDC!!! Po prohledání webu jsem nenašel žádnou dokumentaci o tom, jak to nastavit pomocí Azure AD, takže teď, když mám své nastavení, jsem si myslel, že se podělím.\nKrok 1 – Přihlaste se do Azure AD a klikněte na Registrace aplikací .\n\nKrok 2 – Klikněte na Nová registrace a přidejte název a jeden ze svých serverů Proxmox\n\nKrok 3 – Přidejte všechny své adresy URL pro servery Proxmox kliknutím na Přidat URI a poté na Uložit.\n\nKrok 4 – Klikněte na Certificates & Secrets (Certifikáty a tajemství) a poté na New Client Secret (Nový tajný klíč klienta), kde můžete určit, kdy chcete, aby platnost tajemství vypršela. Ujistěte se, že jste tajemství uložili pod Value, budeme to potřebovat později.\n\nKrok 5 – Klikněte na Přehled Kopírovat ID klienta a poté klikněte na Koncové body\n\nZkopírujte odkaz na dokument metadat OpenID Connect a odstraňte /.well-known/openid-configuration tuto část z odkazu, takže skončíte s něčím takovýmhttps://login.microsoftonline.com/{Vaše ID tenanta}/v2.0\n\nKrok 6 – Přejděte na Proxmox and Authentication – Add – OpenID Connect a poté přidejte hodnoty pro Azure AD\n\nNyní se odhlaste a přihlaste se svou novou sférou a měli byste být připraveni. To by mělo být v podstatě stejné, pokud používáte Okta, ADFS nebo něco jiného. Myslím, že hlavní věc, kterou potřebujete vědět, je, že adresa URL vydavatele skutečně hledá vaše metadata OpenID Connect a k adrese URL automaticky připojuje /.well-known/openid-configuration , takže je nemusíte přidávat znovu.\n"}, {"name": "second dhcp + drbl", "date": "10.1.2023", "author": "admin", "url": "https://blog.iservery.com/2023/01/10/second-dhcp-drbl/", "content": "\nHi Steven!Will try give details of my steps.Configuration:– central server „Rain“ (DHCP) connected to 12 subnets (192.168.10.x – 192.168.120.x);– server „Drbl“ (Clonezilla) connected to same subnets;– from 3 to 25 computers in each subnet;\n==Part of dhcpd.conf from Rain===server-identifier rain.ctd.loc;option domain-name „ctd.loc“;option domain-name-servers ns.ctd.loc;\nsubnet 192.168.10.0 netmask 255.255.255.0 {  authoritative;  option routers                  192.168.10.100;  option subnet-mask              255.255.255.0;  option broadcast-address        192.168.10.255;  option domain-name-servers      192.168.10.100;  option netbios-name-servers     192.168.10.100;  host pc10-1 {   hardware ethernet 00:aa:aa:aa:aa:03;   fixed-address 192.168.10.1;   }  host pc10-2 {   hardware ethernet 00:aa:aa:aa:aa:98;   fixed-address 192.168.10.2;   }\n… and so on for all subnets…\n  host pc12-25 {   hardware ethernet 00:ff:ff:ff:ff:45;   fixed-address 192.168.120.25;   }}===end of dhcpd.conf===\n1) Do steps from 1 to 3a by this: http://drbl.sourceforge.net/one4all ;2) Copy dhcpd.conf from Rain, parse it with „/opt/drbl/bin/parse_dhcpd_conf“;3) Collect parsed MAC addresses and put them into /etc/drbl/macadr-eth0.1.txt, macadr-eth0.2.txt, etc;4) Collect parsed names/IP’s and:  a) put them all to /opt/drbl/conf/client-ip-hostname  b) put them to /etc/drbl/IP-grp-AA, IP-grp-BB, etc by subnets5) Create „dummy“ interface for „WAN“ purpose (my Drbl has no internet connection);6) Run „/opt/drbl/sbin/drblpush -i“ and used already collected MAC’s in macadr-eth0.*.txt files;7) Run „/opt/drbl/sbin/mknic-nbi –udhcpc-port 1068“;8) Run two dhcpd instances:  a) /usr/sbin/dhcpd -q -pf /var/run/dhcpd67.pid  b) /usr/sbin/dhcpd -q -pf /var/run/dhcpd1067.pid -p 1067\n=== Can you suggest a way to modify /etc/init.d/dhcpd script to achieve this? ===\n9) Run /opt/drbl/sbin/dcs and start enjoying =)\nNow client work as follow:– power on, PXE ROM in network card (pxeclient) asks DHCP with ip, subnet, filename, next-server options;– Rain answers with ip and subnet options (pxeclient ignores);– Drbl answers with ip, subnet, filename, next-server options (pxeclient accepts);– pxeclient receive menu, then receive linux kernel and vfs file via tftp;– linux booting in client memory, now it linuxclient 🙂 ;– linuxclient asks ip, subnet, next-server on 1067 port, wait answer to 1068 port from „drbl“;– Drbl answers from 1067 to clients 1068 port (linuxclient accepts);– cloning or deploying;– w1nd0ws booting and asks for ip and subnet (winclient);– Rain or Drbl (who faster) answers (winclient accepts).\nAs result my DRBL server works in current environment.\n=====================================================================Please, let me know, if you find „proxy DHCP“ daemon for Linux! Because with it, life would be much easier (there are only one dhcpd.conf with „host“ entries)! =)\nClient work WITH PROXY DHCP:– power on, PXE ROM in network card (pxeclient) asks DHCP with ip, subnet, filename, next-server options;– Rain answers with ip and subnet options (pxeclient ignores);– proxyDHCP forwards the same Rain’s answer and add to it filename and next-server options (pxeclient accepts);– pxeclient receive menu, then receive linux kernel and vfs file via tftp;– linux booting in client memory, now it linuxclient :-);– linuxclient asks ip, subnet, next-server on 67/68 port, wait answer from any server (/opt/drbl/sbin/mknic-nbi –check-server-name n);– proxyDHCP forwards usual Rain’s answer and add to it filename option (linuxclient accepts);– cloning or deploying;– w1nd0ws booting and asks for ip and subnet (winclient);– Rain answers (winclient accepts).=====================================================================\nThank you for cooperate!\n"}, {"name": "Těstoviny 100krat jinak 😄", "date": "16.4.2022", "author": "admin", "url": "https://blog.iservery.com/2022/04/16/testoviny-100krat-jinak-%f0%9f%98%84/", "content": "\n\nhttp://cuocadolce.blogspot.com/2020/03/5-rychlych-omacek-na-testoviny.html?m=1\n\n"}, {"name": "Těstoviny se zeleným hráškem", "date": "16.4.2022", "author": "admin", "url": "https://blog.iservery.com/2022/04/16/testoviny-se-zelenym-hraskem/", "content": "\n\nhttps://www.washingtonpost.com/food/2022/04/14/pasta-with-smothered-peas-recipe/\n\n\n"}, {"name": "Zajímavé rozšíření PROXMOXu 7..", "date": "4.4.2022", "author": "admin", "url": "https://blog.iservery.com/2022/04/04/zajimave-rozsireni-proxmoxu-7/", "content": "\nhttps://github.com/ivanhao/pvetools\n"}, {"name": "Pasta cacio e pepe", "date": "1.4.2022", "author": "admin", "url": "https://blog.iservery.com/2022/04/01/pasta-cacio-epasta-cacio-e-pepe-pepe/", "content": "\n\nPasta cacio e pepe\n\nPasta cacio e pepe jsou tradiční římské těstoviny: pecorino a černý pepř, jejichž příprava se zdá jednoduchá, ale není. Musíte umět vytvořit omáčku, která je ve správném místě krémová a bohužel chyba je hned za rohem, stačí málo, abyste se ocitli s hromadou hrudek. Ale pokud budete úspěšní, můžete nepochybně uspět , protože k získání těstovin bude stačit použít několik malých triků. Především výběr sýra, ne ledajakého pecorina, ale výhradně pecorino romano. Voda v těstovinách by měla být málo osolená, protože pecorino je již velmi slané. Černého pepře přidejte hodně. Neptejte se mě, čím to můžete nahradit nebo jestli to můžete odstranit, protože to nejde. Připravujeme tradiční recepturu a připravujeme cacio e pepe. Pepř to bere. Pokud nemáte rádi pepř, můžete si udělat jiný recept. K promíchání omáčky použijte vodu z vaření těstovin, protože škrob uvolněný z těstovin do vody zabrání srážení bílkovin. Jakou pastu použít? Bucatini, špagety, pici, tonnarelli, špagety alla chitarra, pokud se jedná o čerstvé těstoviny. Pro mé cacio e pepe jsem si vybral domácí tagliatelle. Nyní jsme připraveni připravit těstoviny cacio e pepe a umět si vytvořit omáčku, která je ve správném místě krémová a bohužel chyba je hned za rohem, stačí málo, abyste se ocitli s hromadou hrudek !!! Ale pokud budete úspěšní, můžete nepochybně zvitězit i vy, protože k získání těstovin s cacio e pepe bude stačit několik malých triků. \n\nObtížnost NízkáČas na přípravu 10 minutČas na vaření 10 minutPorce 4 osobyZpůsob vaření SporákKuchyně italská\nIngredience\n320 g těstovin200 g Pecorino Romano (středně vyzrálé a nastrouhané)ochutnat Černý pepř v zrnechochutnat sůl\nIngredience\n320 g těstovin200 g Pecorino Romano (středně vyzrálé a nastrouhané)ochutnat Černý pepř v zrnechochutnat sůl\nPřípravaPecorino romano nastrouháme na jemno !!!. Vodu na těstoviny přiveďte k varu (budete muset použít asi polovinu toho, co obvykle používáte, aby byla bohatší na škrob). Dochutíme mírně solí a uvaříme těstoviny. Zrnka pepře rozmačkejte paličkou, polovinu nasypte do pánve a na mírném ohni nechte opéct, poté přidejte dvě naběračky vody na vaření. Těstoviny sceďte ve stavu „al dente“ trochu pevné, přendejte je na pánev s pepřem, za stálého míchání přiveďte k varu přidáním jedné nebo dvou naběraček vařící vody podle potřeby (jakmile oschnou).\nPřipravte si krém pecorino romano: je důležité to udělat na poslední chvíli, odolejte pokušení připravit si ho předem, jinak příliš ztuhne. Do mísy přendejte sto gramů nastrouhaného sýra pecorino, přidejte naběračku vařící vody. Důkladně promícháme metličkou a po troškách přidáme další vodu a poté zbytek pecorina (trochu si necháme stranou na dochucení na závěr) vždy promícháme metličkou, abychom získali hladký krém bez hrudek.\nPřed přidáním pecorino smetany do těstovin položte misku, která ji obsahuje, na pánev s ještě horkou vodou na vaření těstovin a znovu promíchejte metličkou (tento krok je nutný, aby se smetana pecorino trochu zahřála a měla podobnou teplotu k těstovinám).\nVypněte oheň pod pánví na těstoviny, za stálého míchání kuchyňskými kleštěmi vlijte smetanu pecorino. Dochuťte odloženým pecorinem, znovu promíchejte a ihned podávejte.\nPoznámkaPři realizaci receptu jsem postupoval podle návodu Giallo Zafferana .\n"}, {"name": "MIKROTIK VLAN SWITCH", "date": "4.1.2022", "author": "admin", "url": "https://blog.iservery.com/2022/01/04/mikrotik-vlan-switch/", "content": "\nhttps://www.derekseaman.com/2021/03/home-lab-mikrotik-ccr2004-and-crs317-configuration.html\nVery recently I decided to completely re-do my home lab hardware, and really step things up a few notches. My previous home lab gear was too old to use for anything useful, so out with old and in with the new! As a result of this new gear, I wanted to publish at least one blog post on the network configuration since it’s no longer just a simple flat network. The hardware will support both VMware and Nutanix hypervisors, including SDN solutions like NSX-T. This post will focus on the network, and configuring my MikroTik switch and router.\nMy single server for nested virtualization is:\nDell Precision 7920 TowerDual Intel Gold 5220R CPUs (2.2 GHz, 48 total pCores, 96 threads)384GB DDR4-2666 ECC RAM5TB NVMe local storage (2x 2TB, 1x 1TB) via MegaRAID 9460-16i4 port 10Gbps Marvell 41000 SFP+ NIC (via HPE)\nFor my lab network gear, I have:\nMikroTik CRS317-1G-16S+RM (16x 10 Gbps SFP+ ports) – Layer 2 switchMikroTik CCR2004-1G-12S+2XS (12 10 Gbps SFP+ ports) – Router\nAs you can see, this is a pretty beefy lab with one decked out workstation for virtualization, and upstream 10Gb switching and routing. While the Dell Precision 7920 is not on the VMware HCL, the NIC and RAID card are. So I had no issues installing ESXi 7.0 U2, and didn’t have to manually install any driver VIBs.\nBecause I’ll be building up and tearing down nested environments on a regular basis, I wanted all lab gear on their own networks, routed with my home LAN and internet. I set aside 172.16.0.0/12 for the lab networks. My home LAN is on the 10.13.2.0/24 network. The diagram below shows the physical topology of network. Note the NSX-T portion is still under construction, and more will come in the future on that.\nAs you can see, my workstation is configured with vSphere using three VLANs for traffic separation. I’m not using vSAN, or that would be on yet another port group and VLAN. Two physical NICs are dedicated to a management distributed switch (left), and two will be used for NSX-T (right). The MikroTik CRS317 will handle all the layer 2 switching needs, while the CCR2004 will handle all routing for the network and out to the rest of the LAN. The purple 1G LAN switch is just an unmanaged switch that’s in the room to support additional devices in the same room and serves as an uplink to the rest of the LAN.   \n\n\nMikroTik CRS317-1G-16S+RM Switch Config\nWhen looking at what network gear to use, I really wanted to go 10Gb end-to-end, to help future proof the network for the foreseeable future. Enterprise class 10Gb switches and routers are extremely pricey, and not in my home budget. However, with some performance cautions, the MikroTik gear supports 10Gb traffic and is extremely affordable. Would I use MikroTik in a true enterprise environment? Nope! But it’s working well for a home lab with modest performance requirements. \nFirst up, I wanted to configure the CRS317-1G-16S+RM, strictly for layer 2 operation. And I wanted the 1Gbps management port on my 10.13.2.x network for out of band management of the 172.16.0.0 address space. If you reset your CRS317 to the default state and remove the default configuration, you can simply copy/paste all of the commands below and completely configure the switch without touching the UI. \nNote that both the router and switch are configured for jumbo frames, so that I can deploy any SDN I wish.\n\t\t\t\t\n\t\t\t\t\t# Setup OOB management interface\n/interface ethernet set [ find default-name=ether1 ] name=MGMT\n/ip address\nadd address=10.13.2.11/24 interface=MGMT network=10.13.2.0\n# Global Settings\n/ip route add dst-address=0.0.0.0/0 gateway=10.13.2.1\n/ip dns\nset servers=10.13.2.200,10.13.2.201\n/system identity\nset name=CRS317\n/system ntp client\nset enabled=yes primary-ntp=216.239.35.8 secondary-ntp=216.239.35.4\n/user set 0 password=\"password\"\n# Set Jumbo frames\n/interface ethernet\nset sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus16 l2mtu=10218\nset sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus16 mtu=9000\n# Bridge Configuration\n/interface bridge\nadd name=bridge vlan-filtering=no mtu=9000\n/interface bridge port\nadd bridge=bridge interface=sfp-sfpplus1 hw=yes disabled=no\nadd bridge=bridge interface=sfp-sfpplus2 hw=yes disabled=no\nadd bridge=bridge interface=sfp-sfpplus3 hw=yes disabled=no\nadd bridge=bridge interface=sfp-sfpplus4 hw=yes disabled=no\nadd bridge=bridge interface=sfp-sfpplus16 hw=yes disabled=no\nset bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged [find interface=sfp-sfpplus1] \nset bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged [find interface=sfp-sfpplus2]\nset bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged [find interface=sfp-sfpplus3]\nset bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged [find interface=sfp-sfpplus4]\nset bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged [find interface=sfp-sfpplus16]\n/interface bridge vlan\nadd bridge=bridge tagged=sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus16 vlan-ids=2611\nadd bridge=bridge tagged=sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus16 vlan-ids=2612\nadd bridge=bridge tagged=sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus16 vlan-ids=2613\n/interface vlan\nadd name=2611-MGT interface=bridge vlan-id=2611 mtu=9000\nadd name=2612-vMotion interface=bridge vlan-id=2612 mtu=9000\nadd name=2613-VM interface=bridge vlan-id=2613 mtu=9000\n/interface bridge set bridge vlan-filtering=yes ingress-filtering=yes frame-types=admit-only-vlan-tagged\n\t\t\t\t\n\nMikroTik CCR2004-1G-12s+2XS Config\nA bit more tricky to configure is the MikroTik CCR2004 router. Since this will be routing between various VLANs and the rest of my home network, the configuration is a bit more nuanced. However, it is still really easy to understand once you get it up and running. Unlike the CRS317, I’m NOT connecting the management port on the CCR2004, as the router has an uplink to the house LAN that I can use to configure the switch. The running configuration of my router is below. Again, if you reset the router to factory defaults and remove the default configuration, you can simply copy/paste the config below for the full configuration without touching the UI.\n\t\t\t\t\n\t\t\t\t\t# Global settings \n/ip route add dst-address=0.0.0.0/0 gateway=10.13.2.1 \n/ip dns \nset servers=10.13.2.200,10.13.2.201 \n/system identity \nset name=CCR2004 \n/system ntp client \nset enabled=yes primary-ntp=216.239.35.8 secondary-ntp=216.239.35.4 \n/user set 0 password=\"password\" \n# Set Jumbo frames \n/interface ethernet \nset sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus5,sfp-sfpplus6,sfp-sfpplus7,sfp-sfpplus8,sfp-sfpplus9,sfp-sfpplus10,sfp-sfpplus11,sfp-sfpplus12 l2mtu=9578\nset sfp-sfpplus1,sfp-sfpplus2,sfp-sfpplus3,sfp-sfpplus4,sfp-sfpplus5,sfp-sfpplus6,sfp-sfpplus7,sfp-sfpplus8,sfp-sfpplus9,sfp-sfpplus10,sfp-sfpplus11,sfp-sfpplus12 mtu=9000\n# Setup Bridge \n/interface bridge \nadd name=bridge vlan-filtering=no mtu=9000\n/interface bridge port \n# upstream port will be untagged (access) port of VLAN ID 42 \nadd bridge=bridge pvid=42 ingress-filtering=yes frame-types=admit-only-untagged-and-priority-tagged interface=sfp-sfpplus1\n# The rest of SFP+ ports are bridged together, all tagged \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus2 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus3 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus4 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus5 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus6 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus7 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus8 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus9 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus10 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus11 disabled=yes \nadd bridge=bridge ingress-filtering=yes frame-types=admit-only-vlan-tagged interface=sfp-sfpplus12 \n/interface bridge vlan \n# sfp-sfpplus1 gets added as untagged automatically due to pvid setting above\nadd bridge=bridge tagged=bridge vlan-ids=42  \nadd bridge=bridge tagged=bridge,sfp-sfpplus12 vlan-ids=2611 \nadd bridge=bridge tagged=bridge,sfp-sfpplus12 vlan-ids=2612 \nadd bridge=bridge tagged=bridge,sfp-sfpplus12 vlan-ids=2613 \n/interface vlan \nadd name=WAN interface=bridge vlan-id=42 \nadd name=2611-MGT interface=bridge vlan-id=2611 mtu=9000\nadd name=2612-vMotion interface=bridge vlan-id=2612 mtu=9000\nadd name=2613-VM interface=bridge vlan-id=2613 mtu=9000\n/ip address \nadd address=10.13.2.10/24 interface=WAN \nadd interface=2611-MGT address=172.26.11.1/24 \nadd interface=2612-vMotion address=172.26.12.1/24 \nadd interface=2613-VM address=172.26.13.1/24 \n/interface bridge set bridge vlan-filtering=yes\n\t\t\t\t\n\nSummary\nSetting up a new lab is always exciting, and a great learning experience. Getting the MikroTik configurations exactly right did take some time and research. But RouterOS is very flexible, and there are great support forums for questions. So far I’m happy with the gear I’ve purchased, and it should lead to a lot more blog content over the coming years. If you want to setup a similar configuration, you can easily take the running configs I have and modify them as needed to suite your needs. \n"}, {"name": "Proxmox GRID vGPU", "date": "30.12.2021", "author": "admin", "url": "https://blog.iservery.com/2021/12/30/proxmox-grid-vgpu/", "content": "\nhttps://veil-update.mashtab.org/drivers/nvidia_drivers/\n\nProxmox 7 vGPU\n\nhttps://theorangeone.net/posts/lxc-nvidia-gpu-passthrough/\n"}, {"name": "RESEARCH ON PERFORMANCE TUNING OF HDD-BASED CEPH* CLUSTER USING OPEN CAS", "date": "12.9.2021", "author": "admin", "url": "https://blog.iservery.com/2021/09/12/research-on-performance-tuning-of-hdd-based-ceph-cluster-using-open-cas/", "content": "\nsource is here https://01.org/blogs/tingjie/2020/research-performance-tuning-hdd-based-ceph-cluster-using-open-cas\nPREFACE\nCeph* is a widely used distributed-storage solution. The performance of Ceph varies greatly in different configuration environments. Many clusters in production environments are deployed on hard disks. For various types of workloads, performance requirements are also different.\nWe built a Ceph cluster based on the Open-CAS caching framework. We made some adjustments to the characteristics so the system could cope with workloads that support large-scale sequential access. The adjustments provided better support for trading-system applications based on random access with a small block size.\nSCENARIO\nThe random access of HDD is restricted by the seek time of the magnetic head, which causes the performance of random access to drop very severely compared with an SSD. For a 10,000 RPM mechanical hard disk, the IOPS (input/output operations per second) of random read and write is only about 350. Ceph clusters based on mechanical hard drives cost less and are suitable for sequential access loads of large-scale data but are not suitable for small-block data access in OLTP (On-line transaction processing) workload. How can we improve the access performance of small random operations with competitive costs? We propose the Open-CAS caching framework to accelerate Ceph OSD nodes.\nThe baseline and optimization solutions are shown in Figure 1 below.\n\nFigure 1: Ceph cluster performance optimization framework based on Open-CAS\nBaseline configuration: An HDD is used as a data partition of BlueStore, and metadata (RocksDB and WAL) are deployed on Intel® Optane™ SSDs.Optimized configuration: An HDD and NVMe* SSD are combined into a new CAS device through Open-CAS software as the data partition of BlueStore, and metadata (RocksDB and WAL) are deployed on Intel Optane SSDs.\nOpen-CAS is an open-source cache acceleration solution initiated by Intel. By loading the modules into the kernel, the high-speed media device(s) used as cache, “merge” with slow devices into a new CAS device, thereby improving the overall device read and write performance of the system.\nThe hierarchical structure of Open-CAS in the system is shown in Figure 2 below. OCF (core of Open-CAS, a high-performance block storage cache library written in C) is the filesystem layer showing as below. It is the IO request processing based on the block device layer.\n\nFigure 2:  Open-CAS framework\nThis article focuses on how to configure and optimize Open-CAS and build a Ceph cluster with it.\nPERFORMANCE EVALUATION\nSETUP\nWe built a distributed storage cluster based on Ceph. On the server side, the Ceph cluster is deployed by CeTune to provide storage services. On the client side, we deployed the Vdbench benchmark to verify our expectation. Vdbench is a popular IO benchmark tool written in Java*, which supports multi-process concurrent read and write tests on block devices in various modes.\nTable1: Ceph Cluster Configuration\nHardware Configuration   –          CPUServer: 2 * Intel® Xeon® Platinum 8260L CPU @ 2.40GHzClient: Intel® Xeon® Gold 6252 CPU @ 2.10GHz –          MemoryServer: 3 * 192 GB –          Network SwitchBandwidth 100 Gb –          Intel Optane SSD2 * Intel P4800X 375 GB –          NVMe SSD6 * Intel P4510 1 TB –          HDD12 * 1 TB 1W SAS HDDSystemConfiguration   –          OSUbuntu* 18.04.5 LTS –          Kernel VersionLinux* version 5.4.0-48-generic –          Ceph VersionNautilus 14.2.11 –          Ceph Cluster2 Server node, 1 Client node, replica = 2 –          Open-CAS Version20.09.0.0362.master –          Vdbench Verson5.04.07 ·         For each Ceph Node  –          Intel Optane SSD2 * 375 GB –          NVMe SSD3 * 1.0 TB (6 * 250G) –          HDD6 * 1.0 TB –          OSD Number6 (HDD:OSD = 1:1)\nOPTIMIZED CONFIGURATION OF OPEN-CAS\nFor the optimized solution, we used Open-CAS for the data partition. Open-CAS can be used after compilation and installation: https://open-cas.github.io/guide_introduction.html.\nThe optimized configuration in Open-CAS is shown below:\n# casadm -S -d /dev/nvme2n1p1 -c wb   --force       // Create a new cache device, and return cache ID\n# casadm -A -i -d /dev/sda                          // Add the backend device to the cache device and “merge” into a new CAS device\n# casadm -L                                         // View current Open-CAS configuration information\ntype    id   disk             status    write policy   device\ncache   1    /dev/nvme2n1p1   Running   wb             -\n└core   1    /dev/sda         Active    -              /dev/cas1-1\ncache   2    /dev/nvme2n1p2   Running   wb             -\n└core   1    /dev/sdb         Active    -              /dev/cas2-1\ncache   3    /dev/nvme3n1p1   Running   wb             -\n└core   1    /dev/sdc         Active    -              /dev/cas3-1\ncache   4    /dev/nvme3n1p2   Running   wb             -\n└core   1    /dev/sdd         Active    -              /dev/cas4-1\ncache   5    /dev/nvme4n1p1   Running   wb             -\n└core   1    /dev/sde         Active    -              /dev/cas5-1\ncache   6    /dev/nvme4n1p2   Running   wb             -\n└core   1    /dev/sdf         Active    -              /dev/cas6-1\n \n// The configuration for each cache ID\n# casadm -X -n seq-cutoff -i 1 -j 1 -p always -t 16   // seq-cutoff always and threshold 16KB\n \n# casadm --io-class --load-config --cache-id 1 -f ioclass-config.csv // only cache with request_size <=128K\n# cat ioclass-config.csv\nIO class id,IO class name,Eviction priority,Allocation\n0,unclassified,22,0\n1,request_size:le:131072,1,1\n \n# casadm -X -n cleaning-alru -t 1000 -i 1              // clean policy alru with activity threashold to 1s\n \nWe made several optimizations for the above configuration:\nSequential read and write cut-off: When the IO stream of sequential read and write reaches a certain threshold, the cut-off is turned on. All subsequent read and write requests go directly to backend storage until random access causes the cut-off to be terminated.IO classification and priority definition: We hope to classify the random access by request size, and only cache the data with blocks less than 128K. This requires adding a category based on request_size and setting the eviction priority to high while avoiding too easy to be evicted from the cache.Parameter adjustment of clean policy: Set the default alru policy and shorten the background cleaning reaction time. There are two types of cleaning policies: alru and acp. acp is a more active strategy, but alru is more suitable for when there is free space in the cache, it does not consume too much bandwidth for background cleaning.\nCEPH CLUSTER SETUP AND CONFIGURATION\nWe deployed a three-node Kubernetes* cluster through the CeTune tool; two nodes are for Ceph storage nodes, and one node is for the client.\nCeTune is a framework for deployment, benchmarking, and configuration and adjustment of Ceph cluster performance. It integrates some benchmarking tools and provides various parameter data for system indicators.\nYou can refer to the official documentation to compile and install. Before the deployment, we need to take care multiple configuration items:\nStorage node configuration OSD according to the following format: osd:data:db_wal. Each OSD requires three disks, corresponding to the information of the OSD, the data partition of OSD, and metadata partition of OSD.Network configuration. There is a public network, a cluster network, and a separated Ceph monitor network.\nThe configuration file is in conf/all.conf; the main contents are shown below:\nhead=CephCAS1                               # Head node\nlist_server=CephCAS1,CephCAS2               # OSD nodes\nlist_client=CEPHCLIENT-01\nlist_mon=CephCAS1\ndisk_format=osd:data:db_wal\nCephCAS1=/dev/cas1-1p1:/dev/cas1-1p2:/dev/nvme1n1p5,/dev/cas2-1p1:/dev/cas2-1p2:/dev/nvme1n1p6,/dev/cas3-1p1:/dev/cas3-1p2:/dev/nvme1n1p7,/dev/cas4-1p1:/dev/cas4-1p2:/dev/nvme1n1p8,/dev/cas5-1p1:/dev/cas5-1p2:/dev/nvme1n1p9,/dev/cas6-1p1:/dev/cas6-1p2:/dev/nvme1n1p10\nCephCAS2=/dev/cas1-1p1:/dev/cas1-1p2:/dev/nvme1n1p5,/dev/cas2-1p1:/dev/cas2-1p2:/dev/nvme1n1p6,/dev/cas3-1p1:/dev/cas3-1p2:/dev/nvme1n1p7,/dev/cas4-1p1:/dev/cas4-1p2:/dev/nvme1n1p8,/dev/cas5-1p1:/dev/cas5-1p2:/dev/nvme1n1p9,/dev/cas6-1p1:/dev/cas6-1p2:/dev/nvme1n1p10\n…\npublic_network=192.168.10.0/24             # Based on 100Gb NIC\nmonitor_network=192.168.10.0/24\ncluster_network=192.168.11.0/24\n \nThen we executed the deployment script and created a storage pool.\n# python run_deploy.py redeploy --gen_cephconf                        // Deploy Ceph cluster and wait for finish\n…\n# ceph osd pool create rbd 512 512                                    // 12 OSDs, Set PG num & PGP num to 512 is appropriate\n# ceph osd pool set rbd size 2                                        // Set pool replicated = 2\n# ceph osd pool application enable rbd  rbd --yes-i-really-mean-it\n \n# rbd create --thick-provision --size 65536 rbd/rbd1 --image-format 2 // Create rbd and fill in content atumaticaly, it will take more time\n…\n# rbd map rbd/rbd1                                                    // Map rbd block device on the client side\n \nPERFORMANCE AND COMPARATIVE ANALYSIS\nVDBENCH BENCHMARK ANALYSIS\nTEST ENVIRONMENT AND REPORT\nThe test configuration of Vdbench on the Ceph RBD block device is listed below.\nTest environment   –          DUT number1 –          Baseline Environment12 * 1 TB HDD as OSD –          Optimization Environment12 * 1 TB HDD and 12 * 250 GB NVMe SSD combination devices as OSD –          RBD volume size20 * 64 GB –          Read and write mode4K Random Read4K Random Write4K Random Read(70%) and Random Write(30%)512K Sequential Read512K Sequential Write –          Queue depth16 –          Threads20 –          Duration600 seconds\nThe test report is shown in the graphs below.\n\nFigure 3: Raw performance results for random I/O\n\n Figure 4: Raw performance results for sequential I/O\n\nFigure 5: Open-CAS configuration comparison\nAs you can see from the figure above, in the Open-CAS optimization configuration, the IOPS of random reads (100% cache hits) and random writes has increased by 119.54 times and 86.761 times. The average latency has been reduced to 0.8% and 1.2%, respectively.\nFor sequential reads and writes, we pass the large block of sequential writes directly to the backend and evaluate the performance loss of sequential read and write at the CAS layer. The bandwidth loss of sequential read is 2.8%, and for sequential writes is 5.6%.\nCONFIGURATION STRATEGY OF OPEN-CAS\nThe performance improvement of random access mainly comes from the characteristics of random access of NVMe SSDs. Open-CAS is the equivalent of glue, which combines the advantage of random access of NVMe SSDs with the advantage of HDDs large capacity.\nFor sequential access, multiple HDDs can be used to increase parallelism in a production environment.  The more HDDs in a node, the better the performance of sequential access. This parallelism can offset the impact of limited performance of a single HDD.\n\nFigure 6: R/W performance comparison\n SAS HDD RandWriteSAS HDD RandReadNVMe SSD RandWrite (Intel P4510)NVMe SSD RandRead (Intel P4510)Bandwidth (MB/s)1.311.17983947Average Latency (us)95640.00107043.07125.32130.99\nThe mechanism used by Open-CAS to accelerate the write process mainly depends on whether there is free or clean cache space in the cache pool. When the cache pool is completely “contaminated” by dirty data, the cache pool is invalid for writes, which is also a common characteristic of the cache system.\nThe figure below shows the percentage of “dirty” cache during random writes. As the time goes by, more and more data are written to cache. When the buffer is “dirty” at all, for data consistency consideration, it must be flushed back to backend storage to release the cache space.\n\nFigure 7: Open-CAS dirty rate % increase\nThere are two solutions: increasing “income” and reducing “expenditure”.\nIncreasing “income” means to improve the cache flushing policy. If you flush the cache data to the backend storage faster, then the “contaminated” cache space can be released sooner. The improvement is not obvious since the bottleneck is the low performance of random write to HDD when flushing.Reducing “expenditure” can make for optimal use of cache resources. Several configurations, such as cache-line settings, sequential access cut-off, and IO classification can be accounted into here. The configuration: seq-cutoff bypasses the cache and directly writes to backend storage when sequential IO stream is detected. By this way, only random accessed data will be cached.\nThe performance improvement of random read mainly depends on the read hit rate (read_hit_rate = read_cache_hit_number / total_read_access_number). We verified that 100% hit rate is the ceiling for performance improvement. In the actual environment, the read hit rate depends on many factors, such as the cache capacity and the data access mode. The read hit rate improvement requires a comprehensive design from the application to the cache layer.\nThe following are read and write conditions in the Ceph OSD device (Open-CAS device combined with cache device and backend device) with different access modes, which is collected by the dstat tool:\nDue to the setting of sequential cut-off, the sequential access of large block will store to the backend storage directly.\n\nFigure 8: Sequential read on OSD\n\nFigure 9: Sequential write on OSD\nFor random writes, if the write hits or there is a free or clean cache block, the data can be cached. The following figure shows the ideal situation for all writes to be cached.\n\nFigure 10: Random write on OSD\nIn the case of random read (100% hit rate), all data is read from the cache and uses the full cache capability.\n\nFigure 11: Random read on OSD\nCONCLUSIONS AND RECOMMENDATIONS\nThe configuration described in this article is applicable to general scenarios. It is applicable to the workload with large-scale sequential access and concentrated random access to the Ceph cluster.\nFor the sequential access pattern, the performance advantage of SSD over HDD is not obvious. We set Open-CAS to sequential access cut-off and to directly access backend storage, which can save valuable cache pool resources, and maximizes its capacity for small random-access data. Of course, some scenarios require short-term high performance and low latency. For these scenarios, try full read and write caching. The specific configuration depends on the number and concurrency of HDD and SSD (cache) devices.\nFor random write access with a small block size, the performance depends on the write hit rate and the capacity of clean or free cache blocks in the cache pool. Under ideal conditions (such as clean and free cache blocks or a very high write hit rate), in write-back mode, the write request directly returns from the cache to the application. When the cache pool is full of dirty cache blocks and the write hit rate is very low, the write performance will drop sharply because new write access data needs to be promoted to cache blocks and must wait for the old dirty blocks to be flushed to the backend storage.\nFor random read access with a small block size, the performance depends on the read hit rate. In case of a read miss, the cache needs to access the backend storage to fetch the data and promote it to the cache. In extreme cases, additional flushing of data to backend storage is required.\nHere are several ways to improve the read hit rate on the cache side:\nUse different cache modes, such as write around mode, write invalid mode, etc.The promotion strategy can be set according to the application access patternUse application pre-heating dataOptimize the application access data model\nFor general scenarios, Open-CAS reference configuration is write-back mode, cache-line is 4KB, sequential access cut-off is always on, set IO classification and only cache small random block (request size <=128KB), and use clean policy with default alru while more active parameters adjustment. In an ideal situation, random read IOPS is increased by 119.54 times, random write IOPS is increased by 86.761 times, and access latency is reduced to 0.8% and 1.2% respectively.\nSUMMARY AND OUTLOOK\nIn the HDD-based storage environment, the Ceph cluster with Open-CAS on NVMe SSD as a storage node, cache has significantly improved the performance of the Ceph client block storage for small block random read and write. The replication mechanism in the Ceph storage node ensures the reliability of cached data and write-back mode is suitable for a Ceph storage cluster.\nOpen-CAS supports multiple caching modes and has corresponding preferred configurations for read-only, write-only, and read-write modes. Using the Open-CAS caching framework can take advantage of the high speed random read and write of NVMe SSDs and the large capacity of HDDs.\nThere are several business scenarios that have reference value:\nRandom read and write scenarios of small data blocks with low latency requirements, such as online transaction systems and banking services, which can take advantage of the high-speed random read and write capabilities of NVMe SSD.Large throughput scenarios with massive data, such as video on demand, big data analysis and processing, etc. The multiple concurrent HDD pass-through mode can ensure stable bandwidth and sequential read and write capabilities.\n…………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………….\nREFERENCE\nOpen-CAS: https://open-cas.github.io/CeTune and github：https://github.com/intel/CeTune\nAPPENDIX\nOPEN-CAS PARAMETERS DESCRIPTION\nThere are many parameters of Open CAS; Based on our experience and the testing environment, we evaluated and verified several key parameters that effect performance.\nCACHE MODE\nThere are multiple cache modes supported by Open-CAS. We expect to figure out the mode on mixed read/write operations and majorly to improve random access with small block size. Eventually, we choose write-back mode.\nOn the client side, only kept one copy on the local disk. If the disk is physically damaged, the data will be lost permanently. We deploy the caching solution on the Ceph storage cluster with replication guaranteed which avoids the single point failure.\nThe read/write flow of the write-back mode is shown in the figure below. In addition to the read-write process, Open-CAS flushes dirty data (the cached data is inconsistent with backend storage data) to backend storage according to the cleaning policy.\n\nFigure 12: IO request flow\nCACHE-LINE SIZE\nA cache line is the smallest portion of data that can be mapped into a cache. Every mapped cache line is associated with a core line, which is a corresponding region on a backend storage. The relationship between a cache line and a core line is illustrated on the figure below.\n\nFigure 13: Cache mappings\nThe default size of the Open-CAS cache line ranges from 4K up to 64K, as supported by the current system. The setting is specified when the cache device is created and cannot be modified at runtime.\nFor cache devices with NVMe SSDs, there is no seek time impact of using HDD. There is not much difference in bandwidth for reading small blocks versus large blocks. The larger the cache line setting, the larger the cache space occupied by read/write requests; for access with a small block size, it is also a waste of cache space. In some high throughput scenarios, such as with Intel® Optane™ Persistent Memory, you may need to increase the cache line to increase bandwidth.\nSEQUENTIAL ACCESS CUT-OFF\nWhen the sequential IO stream reaches a certain threshold, the cut-off is turned on. All subsequent sequential read and write requests are sent directly to the backend storage, until cut-off is terminated.\nFor small random blocks, the IOPS of SSD has obvious advantages over HDD. However, for large block sequential read and write, the advantage of SSD as a cache is not obvious, especially as one SSD acts as a cache for multiple HDDs. Therefore, many cache solutions choose to bypass read/write of sequential large blocks and send them directly to backend HDD devices. It can save cache space and accommodate for more data of random access with small block size.\nWe evaluated the performance of SAS HDD disks in different modes and block sizes by using the FIO (jobs=4, queue_depth=8) benchmark. We found that the random read and write performance bandwidth increased with the block size (IOPS did not change much), and sequential read and write performance is less affected by block size.\n\nFigure 14: SAS HDD performance with FIO\nCLEAN POLICY\nIn the cache system, Open-CAS provides the flushing strategies and according parameters to have data flushed from cache to backend storage.\nThe default policy, alru, periodically refreshes dirty data. Using a modified least-recently-used algorithm, the refresh priority is relatively low. Another cleaning policy, acp, clears dirty cache lines as quickly as possible to maintain the maximum bandwidth of backend storage. The acp policy aims to stabilize the data refresh time of write-back mode and maintain more consistent cache performance.\nWe found that the effect of the acp policy is not satisfactory. When performing normal IO operations in the foreground, the acp mode is more active and the flush continues indefinitely. As a result, the performance of read and write operations in the foreground is seriously affected. We set the refresh policy to alru and adjusted the parameters to make the flush operation more active. When the system has free or clean cache space, the alru policy is better.\n\nOTHERS\nOpen-CAS also supports many-to-one mode, in which multiple backend storage devices can be cached by a cache device and the data of these backend storage devices share a cache pool. The advantage is the data access can be balanced. In Ceph, the data distribution of each OSD is not necessarily completely balanced. Sharing a cache pool offsets the cache space waste caused by data imbalance (a typical OSD data distribution is shown below). But the disadvantage in the write-back cache mode is that a single point of failure is unavoided. If multiple OSDs share data in a storage pool, and the storage pool contains all copies of this data, the situation becomes complicated.\nTherefore, we use a one-to-one model, where one cache device corresponds to one backend storage device.\n\nIn addition to these parameters, Open-CAS also provides some media related configurations, such as the support of trim and atomic write, but this requires a specific cache medium and kernel version\n"}, {"name": "Náhrada google analytics …", "date": "8.9.2021", "author": "admin", "url": "https://blog.iservery.com/2021/09/08/nahrada-google-analytics/", "content": "\nhttps://github.com/PostHog/posthog-foss\n"}, {"name": "kubernetes ceph atd", "date": "8.9.2021", "author": "admin", "url": "https://blog.iservery.com/2021/09/08/kubernetes-ceph-atd/", "content": "\n\nzdroj https://cloud.netapp.com/blog/kubernetes-shared-storage-the-basics-and-a-quick-tutorial\nIntroduction\nKubernetes, the awesome container orchestration tool is changing the way applications are being developed and deployed. You can specify the required resources you want and have it available without worrying about the underlying infrastructure. Kubernetes is way ahead in terms of high availability, scaling, managing your application, but storage section in the k8s is still evolving. Many storage supports are getting added and are production-ready.\nPeople are preferring clustered applications to store the data. But, what about the non-clustered applications? Where do these applications store data to make it highly available? Considering these questions, let’s go through the Ceph storage and its integration with Kubernetes.\nWhat is Ceph Storage?\nCeph is an open source, software-defined storage maintained by RedHat. It’s capable of the block, object, and file storage. The clusters of Ceph are designed in order to run on any hardware with the help of an algorithm called CRUSH (Controlled Replication Under Scalable Hashing). This algorithm ensures that all the data is properly distributed across the cluster and data quickly without any constraints. Replication, Thin provisioning, Snapshots are the key features of the Ceph storage.\nThere are good storage solutions like Gluster, Swift but we are going with Ceph for following reasons:\nFile, Block, and Object storage in the same wrapper.Better transfer speed and lower latencyEasily accessible storage that can quickly scale up or down\nWe are going to use 2 types of storage in this blog to integrate with Kubernetes.\nCeph-RBDCephFS\nCeph Deployment\nDeploying highly available Ceph cluster is pretty straightforward and easy. I am assuming that you are familiar with setting up the Ceph cluster. If not then refer the official document here.\nIf you check the status, you should see something like:https://medium.com/media/6ac14a1f7cd854b828c34b4b9e227a43\nHere notice that my Ceph monitors IPs are 10.0.1.118, 10.0.1.227 and 10.0.1.172\nK8s Integration\nAfter setting up the Ceph cluster, we would consume it with Kubernetes. I am assuming that your Kubernetes cluster is up and running. We will be using Ceph-RBD and CephFS as storage in Kubernetes.\nCeph-RBD and Kubernetes\nWe need a Ceph RBD client to achieve interaction between Kubernetes cluster and CephFS. This client is not in the official kube-controller-manager container so let’s try to create the external storage plugin for Ceph.\nCheck the repo here\nhttps://medium.com/media/b65d12f56f2f591ec6262f08c7fbbd6chttps://medium.com/media/d84e860563ee377027d5c59333765491\nYou will get output like this:\n\nhttps://medium.com/media/6953df5fa5e1e81a142e66c2933fbdb1\n\nCheck RBD volume provisioner status and wait till it comes up in running state. You would see something like the following:\n\nhttps://medium.com/media/63d38ab2e4fe984456270e600edd0420\n\nOnce the provisioner is up, provisioner needs the admin key for the storage provision. You can run the following command to get the admin key:\n\nhttps://medium.com/media/db5d9f84eea1b9114cefa04fa80ca6e8\n\nLet’s create a separate Ceph pool for Kubernetes and the new client key:\n\nhttps://medium.com/media/f89bf6b39192538047a7f64f939e5421\n\nGet the auth token which we created in the above command and create kubernetes secret for new client secret for kube pool.\n\nhttps://medium.com/media/af9cbb297aa99f11cf0da0f4dbae4a70\n\nNow let’s create the storage class.\nhttps://medium.com/media/9103199e02f9bf49943f6b891efeb29fhttps://medium.com/media/414761ead76d04c9423b001c88b4069e\nWe are all set now. We can test the Ceph-RBD by creating the PVC. After creating the PVC, PV will get created automatically. Let’s create the PVC now:\nhttps://medium.com/media/0ac38aea05fe17e083cedf2502d3f52ehttps://medium.com/media/35914a1638c566ec559834b9da6e15ed\nIf you check pvc, you’ll find it shows that it’s been bounded with the pv which got created by storage class.Let’s check the persistent volume\n\nhttps://medium.com/media/96f819b98475214f079cfda96eb09e9e\n\nTill now we have seen how to use the block based storage i.e Ceph-RBD with kubernetes by creating the dynamic storage provisioner. Now let’s go through the process for setting up the storage using file system based storage i.e. CephFS.\nCephFS and Kubernetes\nLet’s create the provisioner and storage class for the CephFS. Create the dedicated namespace for CephFS\n\nhttps://medium.com/media/70dc047b8c979f72cdd685ec7871a763\n\nCreate the kubernetes secrete using the Ceph admin auth token\n\nhttps://medium.com/media/6a8259202a9db55dea8253c624aacf2a\n\nCreate the cluster role, role binding, provisioner\nhttps://medium.com/media/e92bfc6149169126fb84d927d566cf25https://medium.com/media/937a95e69c08dd6dbbd47c957dc9f093\nCreate the storage class\nhttps://medium.com/media/9770f5d3f54c6892e1005fa5898f80f0https://medium.com/media/6726614b898ddd6a5aa436882f160fc1\nWe are all set now. CephFS provisioner is created. Let’s wait till it gets into running state.\n\nhttps://medium.com/media/b23e7a398b50a495e82a9c321cbf90bc\n\nOnce the CephFS provider is up, try creating the persistent volume claim. In this step, storage class will take care of creating the persistent volume dynamically.\nhttps://medium.com/media/f0f2fc0967f95fb6793ee78045b6a668https://medium.com/media/d2e0230ded5199d679363ba316331cf9\nLet’s check the create PV and PVC\n\nhttps://medium.com/media/b5b206170860f1a508d1627f2cef52c9\n\nConclusion\nWe have seen how to integrate the Ceph storage with Kubernetes. In the integration, we covered ceph-rbd and cephfs. This approach is highly useful when your application is not a clustered application and if you are looking to make it highly available.\n*****************************************************************\nThis post was originally published on Velotio Blog.\nVelotio Technologies is an outsourced software product development partner for technology startups and enterprises. We specialize in enterprise B2B and SaaS product development with a focus on artificial intelligence and machine learning, DevOps, and test engineering.\nInterested in learning more about us? We would love to connect with you on ourWebsite, LinkedIn or Twitter.\n"}, {"name": "Spannig tree protocol", "date": "12.4.2021", "author": "admin", "url": "https://blog.iservery.com/2021/04/12/spannig-tree-protocol/", "content": "\n\n\n\n\nhttps://www.ciscopress.com/articles/article.asp?p=2832407&seqNum=6\n\n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\n\nSTP Overview\nSpanning Tree Protocol\nTypes of STP– Original STP– STP / 802.1D– PVST+– Cisco improvement adding a per VLAN feature– Cisco default– RSTP / 802.1w– Improved STP with much faster convergence– Rapid PVST+– Cisco improvement of RSTP adding per VLAN feature– Makes a large network more efficient\nWhy STP?– STP is used to prevent loops when using redundant switches– Broadcast messages are sent all the time and Broadcast Storms are easy to trigger– Loops also cause unstable MAC address tables because they’re constantly being changed/updated– Duplicate frames are being sent to the same host\nHow STP Works– Switches in a loop ‚drop‘ one of the ports– Switch with the blocked port still receives the data but it ignores it– Simple but how the switches choose the port to block can be tricky\nChoosing the blocked port– 1) Elect a root bridge– King of switches– 2) Place root bridge interfaces into a Forwarding state– 3) Each non-root switch selects its Root Port– This is the best route to the bridge– 4) Remaining links choose a Designated Port– 5) All other ports are put into a Blocking state\nRoles– Root Ports– The best port to reach the Root Bridge– Designated Port– Port with the best route to the Root Bridge on a link– Non-Designated Ports– All other ports that are in a blocking state\nStates– Disabled– Port that is shutdown– Blocking– A port that is blocking traffic– Must move to Listening state before moving to Forwarding– Listening– Not forwarding traffic and not learning MAC addresses– Transitional State while changing from 1 role to another– Held in this state for the Forward Delay timer (15 sec default)– Learning– Not forwarding traffic but learning MAC addresses– Transitional State while changing from 1 role to another– Held in this state for the Forward Delay timer (15 sec default)– After this, the port can now move to a Forwarding state– Forwarding– Sending and receiving traffic like normal– Can move directly to Blocking\nRoot Bridge Election– Each switch has a BPDU. BPDU contains:– Root Cost– Cost of the root bridge– BID (Bridge ID)– The switch with the lowest overall BID will become the root bridge– They look something like: 32769aaaa:aaaa:aaaa– BID is made up of:– STP priority– Default value of 32768 + VLAN number– For VLAN 1, the STP priority would be 32769– MAC Address– Each switch thinks it should be the root bridge– They share their BPDUs with each other– Once they all agree, the root bridge has been elected– All ports on the root bridge enter a Forwarding State– Each non-root switch will now choose the best path to the root bridge– This is the Root Port– This is based on Port Cost– Cost is based on port speed– Better speed, lower cost– Each outgoing port to the root added together– Can be set manually– If a tie happens, they look at lowest neighbor BID– If they tie, they use lowest neighbor port priority– If they tie, lowest neighbor port number– Select a Designated Port– Look at lowest root cost to the bridge– If that ties, lowest BID– If that ties, lowest neighbor port priority– If that ties, lowest neighbor port number– Every port that is not a root port of designated port is put in a Blocking State\nDownfall of STP — Convergence– The time it takes to do the work and become stable\nTimers – Default (RSTP addresses the delay of convergence)– Hello– Every 2 seconds– Lets everyone know everything is still alive– MaxAge– 10x Hello timer by default (20 seconds)– The time the switch will wait before it realizes something is wrong– Forward Delay– 15 seconds– The time between the Listening and Learning state\n"}, {"name": "Domácí pancetta", "date": "12.4.2021", "author": "admin", "url": "https://blog.iservery.com/2021/04/12/domaci-pancetta/", "content": "\nhttps://www.prozeny.cz/clanek/domaci-pancetta-skvela-slanina-bez-uzeni-70854\n\n\nna 2 kusy\nNa maso\n1 bůček bez kosticukr krupicesůl\nNa česnekovo-bylinkovou variantu\n3 lžičky provensálského koření2 lžičky sušeného česneku\nNa pikantní variantu\n1 lžička celého černého pepře5 kuliček jalovce2 lžíce mleté pálivé papriky\nČlánek\nPostup\nKrok 1: Z bůčku bez kosti ořízněte kůži a případné bílé blanky z povrchu. Po očištění vážilo naše maso 600 gramů. Rozřízla jsem ho na poloviny pro dva typy ochucení. Klidně ho nechte v celku – jen podle velikosti masa upravte délku sušení.Domácí sušená panenka. Bez éček a dusitanů!Paprikovo-česnekový vepřový bůček\nKrok 2: Maso omyjte, pořádně osušte a v uzavíratelné misce ho zasypejte cukrem (cca 200 g), aby bylo celé zakryté. Zavřete a nechte 2 dny (cca 36 až 48 hodin) v lednici. Poté maso vyndejte z cukru, důkladně omyjte a osušte a stejným způsobem naložte do soli, tentokrát jen na asi 30 hodin. Cukr a sůl z masa vytáhnou vodu a zakonzervují ho, nicméně mu také dodají chuť, a čím déle v nich bude, tím bude nasládlejší, nebo naopak slanější.\nKrok 3: Uleželé maso pořádně omyjte od soli, osušte a můžete se pustit do obalování v koření. Na jednu polovinu masa jsem použila čerstvě nadrcený pepř a jalovec smíchaný s pálivou paprikou (pro extra odolné můžete přidat chilli, pro jemnější jazýčky naopak dát jen sladkou papriku). Na druhou půlku přišly provensálské bylinky se sušeným česnekem. S kořením experimentujte, skvělá je i kombinace uzené papriky a drceného kmínu nebo rozmarýnu s pepřem a špetkou muškátu. Vůbec nic také nezkazíte jen samotným pepřem.Nakládaný bůček za studena: dobrota na každou partyUzené maso vařené v kofole\nKrok 4: Maso napíchněte na háček, kus čistého drátu, starou pletací jehlici nebo jinou pomůcku a pověste na větrané místo. Chladnější místnost je lepší, ale pokojová teplota nic nezkazí. Důležité je, aby okolo masa trochu proudil vzduch (tedy třeba na garnýži, u okna otevřeného na mikroventilaci, v domácí vinotéce a podobně).\nKrok 5: Maso jsem nechala viset 16 dnů a bylo už krásně prosušené. Můžete začít ochutnávat klidně už dřív, nebo bůček naopak dosušit úplně dotuha. Doba sušení hodně záleží na velikosti masa. Hotovou pancettu skladujte buď dále pověšenou, nebo v lednici.Šéfkuchaři vaří: Speciality z masaMarinovaný losos na chlebíčky – gravlax ze 4 surovin\nTakto sušené maso je skvělé jen tak na plátky k pivu a vínu, báječně se hodí do špaget carbonara. Vynikající je i slaný cibulový koláč s pancettou. Anebo zkusíte karbanátek balený v pancettě?\n"}, {"name": "Dell perc 6i linux", "date": "20.2.2021", "author": "admin", "url": "https://blog.iservery.com/2021/02/20/dell-perc-6i-linux/", "content": "\nhttps://null.53bits.co.uk/index.php?page=dell-omsa-on-linux\nDell OMSA on Linux\nWhere are the Dell repo’s:\n\nhttp://linux.dell.com/wiki/index.php/Repository\n\nwget -q -O - http://linux.dell.com/repo/hardware/latest/bootstrap.cgi | bash\nyum install srvadmin-all\nOMSA changes for non-RHEL (CentOS) systems:\n/etc/redhat-release : \"Red Hat Enterprise Linux Server release 5 (Tikanga)\"\nOMSA Live CDs:\n\nhttp://linux.dell.com/files/openmanage-contributions/\n\nCentOS Live CDs:\nhttp://wiki.centos.org/Manuals/ReleaseNotes (At the bottom you fool)\nPre reqs for BIOS/Firmware updates:\nyum install compat-libstdc*  libstdc++\nOMSA on Ubuntu;\nReferences;http://www.keithscode.com/linux-tutorials/installing-dell-openmanage-server-administrator-on-ubuntu.htmlhttp://ubuntuforums.org/showpost.php?p=2336772&postcount=54\nhttp://www.ccn.ucla.edu/users/jkyle/weblog/e14bd/Dell_Perc_5i_on_Ubuntu_64.html\n\n# Kernel modulessudo modprobe ipmi_msghandlersudo modprobe ipmi_devintfsudo modprobe ipmi_s# Sometimes this is `sudo modprobe ipmi_si` on 64bit machines\n\n\necho \"ipmi_msghandler\" >> /etc/modulesecho \"ipmi_devintf\" >> /etc/modulesecho \"ipmi_si\" >> /etc/modules\n\n\n# To use a repo stop here and perform add to /etc/apt/sources.list# \"deb ftp://ftp.sara.nl/pub/sara-omsa dell sara\"# then run;# wget http://ftp.sara.nl/debian_sara.asc# sudo apt-key add debian_sara.asc# sudo apt-get update # Now there is no need to download the debian packages below\n\n\n#Install IPMI tools;#yum install openipmi ipmitoolsudo apt-get install openipmisudo apt-get install ipmitool #Install OMSA dependancies:sudo apt-get install snmp snmpdsudo apt-get install -f lib32ncurses5 #sudo apt-get install -f libncurses5 sudo apt-get install -f ia32-libs #Only needed for 64bit machines# on 64bit machines; # dpkg --add-architecture i386 # this will enable the installation of i386 packages on x64# apt-get update\n\n\n# If not use the deb packages below but the repo above, at this point you can execute;# sudo apt-get install dellomsa \n\n\n#Grab OMSA and debian package (can be http): ONLY IF NOT USING REPO ABOVE #wget ftp://ftp.sara.nl/pub/outgoing/dell/binary-i386/dellomsa_5.5.0-5_i386.debwget ftp://ftp.sara.nl/pub/outgoing/dell/binary-amd64/dellomsa_5.5.0-5_amd64.debdpkg -i dellomsa_5.5.0-5_amd64.deb#At this point, run the following to update libraries when using either repo or deb pkg sudo ldconfig#For 32bit machine with library/dependencies missing;sudo apt-get install libstdc++5#May require: sudo apt-get install gcc-3.3-base#For 64 bit machine we may need 32bit libstdc++5 from here, forced install on 64 bit machine:wget http://ftp.de.debian.org/debian/pool/main/g/gcc-3.3/libstdc++5_3.3.6-20_i386.deb# http://ftp.de.debian.org/debian/pool/main/g/gcc-3.3/libstdc++5_3.3.6-20_amd64.deb# Mirrors;# /uploads/linux/dell/libstdc++5_3.3.6-20_i386.deb# /uploads/linux/dell/libstdc++5_3.3.6-20_amd64.debsudo dpkg --force-architecture -i libstdc++5_3.3.6-20_i386.deb#Some links maybe needed:#sudo ln -s /usr/lib/libstdc++.so.5 /lib/libstdc++.so.5#sudo ln -s /usr/lib/libstdc++.so.5 /lib32/libstdc++.so.5#sudo ln -s /usr/lib/libstdc++.so.5 /lib64/libstdc++.so.5#Pop this handy script into /etc/init.d (Thanks to James Kyle) and run it sudo wget -O /etc/init.d/dell_omsa.sh http://null.53bits.co.uk/uploads/linux/dell/dell_omsa.shsudo chmod +x /etc/init.d/dell_omsa.shsudo /etc/init.d/dell_omsa.sh\n\n\n# Enable SNMP in OMSA sudo /etc/init.d/dataeng enablesnmp# Make sure both are running sudo /etc/init.d/snmpd restartsudo /etc/init.d/dataeng startsudo /etc/init.d/dsm_om_connsvc startsudo /etc/init.d/dsm_om_shrsvc start #Download 32bit pam auth modules if on 64 (also, force inet4 sometimes):wget http://mirrors.kernel.org/ubuntu/pool/main/p/pam/libpam-modules_1.1.3-2ubuntu1_i386.deb --inet4-only# Newer versions:# http://mirrors.kernel.org/ubuntu/pool/main/p/pam/libpam-modules_1.1.3-6ubuntu1_amd64.deb# http://mirrors.kernel.org/ubuntu/pool/main/p/pam/libpam-modules_1.1.3-6ubuntu1_i386.debdpkg-deb -x libpam-modules_1.1.3-2ubuntu1_i386.deb ./cd ./lib/i386-linux-gnu/securitysudo cp pam_unix.so /lib32/securitysudo cp pam_nologin.so /lib32/securitysudo ldconfig \n\n\n# Look at 32bit/64bit mixing authentication errors here:# https://oss.trac.surfsara.nl/omsa_2_deb/ticket/37#Restart sudo /etc/init.d/dsm_om_connsvc restart#OMSA seems to bind to IPv6 as shown by netstat -nl, check in /opt/dell/srvadmin/iws/config/iws.ini# tcp6 :::1311#browser: https://[2a01:420:9:0:213:72ff:fe53:2c05]:1311# omreport and omconfig can now be used for remotely configuring and reporting on the Perc RAID controller(s);#sudo omreport storage controller#sudo omreport storage controller controller=0# consistency check on vdisk 0 on controller 0#sudo omconfig storage vdisk action=checkconsistency controller=0 vdisk=0 #sudo omreport storage controller No controllers found#try;# sudo apt-get install dkms# sudo service dataeng restart#Physical disks sudo omreport storage pdisk controller=0# If you get the error:# omreport: error while loading shared libraries: libpam.so.0# sudo apt-get install libpam0g:i386\nMegaCLI/MegaRAID\n# might need the following if not installed\nsudo apt-get install alien unzip\n# might also need\nsudo apt-get install sysfsutils\n\n#Download link\nwget http://www.lsi.com/downloads/Public/MegaRAID%20Common%20Files/8.02.16_MegaCLI.zip\n# mirror:\n# /uploads/linux/dell/8.02.16_MegaCLI.zip\nunzip 8.02.16_MegaCLI.zip\ncd LINUX\nunzip MegaCliLin.zip\n# Install the bundled libraries;\nsudo alien -iv Lib_Utils-1.00-09.noarch.rpm\n\n# Upack;\nrpm2cpio MegaCli-8.02.16-1.i386.rpm | cpio -dimv\n\n# copy files to /opt\nsudo mv opt/MegaRAID/ /opt/\ncd /opt/MegaRAID/MegaCli/\nsudo ./MegaCli -AdpEventLog -GetEvents -aAll\n\n# These maybe are needed if OMSA isn't installed as above and cary change for 32/64bit systems;\n# sudo apt-get install -f lib32ncurses5\n# sudo apt-get install -f lib32ncurses5\n# sudo apt-get install -f libncurses5\n# sudo apt-get install gcc\n\n# Install reference:\n# http://staff.blog.ui.ac.id/jp/2010/10/07/installing-megacli-in-debian-based-system/\n\n# Example commands:\n# http://tools.rapidsoft.de/perc/perc-cheat-sheet.html\n\n# Controller information\nMegaCli -AdpAllInfo -aALL \nMegaCli -CfgDsply -aALL \nMegaCli -AdpEventLog -GetEvents -f events.log -aALL && cat events.log\n\n# Enclosure information\nMegaCli -EncInfo -aALL\n\n# Virtual drive information\nMegaCli -LDInfo -Lall -aALL\n\n# Physical drive information\nMegaCli -PDList -aALL \nMegaCli -PDInfo -PhysDrv [E:S] -aALL\n\n# Battery backup information\nMegaCli -AdpBbuCmd -aALL\n\n# Check State of Health\n./MegaCli adpbbucmd getbbustatus a0 | grep SOH\n\n\n# Updating firmware\nmkdir fw\ncd fw\nwget \"http://ftp.us.dell.com/SAS-RAID/DELL_PERC-6-I-INTEGRATED_A12_R278433.exe\"\nunzip DELL_PERC-6-I-INTEGRATED_A12_R278433.exe\nMegaCli64 -adpfwflash -f FW952II.rom -a0\n# That is actually a Windows firmware update file but it has the same rom in side it;\n\n\n./MegaCli64 -adpfwflash -f FW1371iI.rom -a0\n                                     \nAdapter 0: PERC 6/i Integrated\nVendor ID: 0x1000, Device ID: 0x0060\n\nPackage version on the controller: 6.1.1-0047 \nPackage version of the image file: 6.3.1-0003 \nDownload Completed.     \nFlashing image to adapter...\nAdapter 0: Flash Completed.\n\nExit Code: 0x00\n\n# For older perc cards like perc 4's, try lsiutil, or use omreport above# wget http://www.lsi.com/downloads/Public/Obsolete/Obsolete%20Common%20Files/LSIUtil_1.62.zip# mirror: wget  /uploads/linux/dell/LSIUtil_1.62.zip\nPower Monitoring\n# omreport chassis pwrsupplies\nPower Supplies Information\n\nPower Supply Redundancy\nRedundancy Status : Full\n\nIndividual Power Supply Elements\nIndex                    : 0\nStatus                   : Ok\nLocation                 : PS 1 Status\nType                     : AC\nRated Input Wattage      : [No Value]\nMaximum Output Wattage   : 750 W\nOnline Status            : Presence Detected\nPower Monitoring Capable : Yes\n\nIndex                    : 1\nStatus                   : Ok\nLocation                 : PS 2 Status\nType                     : AC\nRated Input Wattage      : [No Value]\nMaximum Output Wattage   : 750 W\nOnline Status            : Presence Detected\nPower Monitoring Capable : Yes\n\n\n# omreport chassis pwrmonitoring\nPower Consumption Information\n\nPower Consumption\nIndex             : 2\nStatus            : Ok\nProbe Name        : System Board System Level\nReading           : 244 W\nWarning Threshold : 916 W\nFailure Threshold : 964 W\n\nAmperage\nPS 1 Current 1 : 0.8 A\nPS 2 Current 2 : 1.0 A\n\nPower Tracking Statistics\nStatistic               : Energy Consumption\nMeasurement Start Time  : Tue May  6 21:58:38 2008\nMeasurement Finish Time : Wed Feb  1 13:55:29 2012\nReading                 : 1008.6 KWh\n\nStatistic              : System Peak Power\nMeasurement Start Time : Tue May  6 21:58:38 2008\nPeak Time              : Sat Mar  6 23:42:11 2010\nPeak Reading           : 407 W\n\nStatistic              : System Peak Amperage\nMeasurement Start Time : Tue May  6 21:58:38 2008\nPeak Time              : Sat Mar  6 23:23:27 2010\nPeak Reading           : 3.3 A\nIPMI Commands\n#Graceful restartipmitool -I lanplus -H 172.22.0.150 -U root -P password chassis power soft\n#Boot from CD\nipmitool -I lan -H 172.22.0.150  -U root -P password chassis bootdev cdrom\n#Enable Serial-over-Labelipmitool -I lanplus -H 172.22.0.150 -U root -P password sol activate# Dont forget to enable Bios > Serial Communication > \"On with Console Redirection via COM2\" and \"Redirect after Reboot\" \nRAID Monitoring\n# List storage controllers\n# omreport storage controller\n\n Controller  PERC 4e/Di (Embedded)\n\nControllers\nID                                : 0\nStatus                            : Non-Critical\nName                              : PERC 4e/Di\nSlot ID                           : Embedded\nState                             : Degraded\nFirmware Version                  : 522A\nMinimum Required Firmware Version : 522D\nDriver Version                    : Not Applicable\nMinimum Required Driver Version   : Not Applicable\nNumber of Connectors              : 2\nRebuild Rate                      : 30%\nBGI Rate                          : Not Applicable\nCheck Consistency Rate            : Not Applicable\nReconstruct Rate                  : Not Applicable\nAlarm State                       : Not Applicable\nCluster Mode                      : Not Applicable\nSCSI Initiator ID                 : 7\nCache Memory Size                 : 256 MB\nPatrol Read Mode                  : Auto\nPatrol Read State                 : Stopped\nPatrol Read Rate                  : Not Applicable\nPatrol Read Iterations            : 11526\n\n\n\n# List details from a specific controller\n# omreport storage controller controller=0\n\n Controller  PERC 4e/Di (Embedded)\n\nControllers\nID                                : 0\nStatus                            : Non-Critical\nName                              : PERC 4e/Di\nSlot ID                           : Embedded\nState                             : Degraded\nFirmware Version                  : 522A\nMinimum Required Firmware Version : 522D\nDriver Version                    : Not Applicable\nMinimum Required Driver Version   : Not Applicable\nNumber of Connectors              : 2\nRebuild Rate                      : 30%\nBGI Rate                          : Not Applicable\nCheck Consistency Rate            : Not Applicable\nReconstruct Rate                  : Not Applicable\nAlarm State                       : Not Applicable\nCluster Mode                      : Not Applicable\nSCSI Initiator ID                 : 7\nCache Memory Size                 : 256 MB\nPatrol Read Mode                  : Auto\nPatrol Read State                 : Stopped\nPatrol Read Rate                  : Not Applicable\nPatrol Read Iterations            : 11526\n\nConnectors\nID             : 0\nStatus         : Ok\nName           : Connector 0\nState          : Ready\nConnector Type : SCSI Channel RAID Mode\nTermination    : Wide Terminated\nSCSI Rate      : Ultra 320M SCSI\n\nID             : 1\nStatus         : Ok\nName           : Connector 1\nState          : Ready\nConnector Type : SCSI Channel Non-RAID Mode\nTermination    : Wide Terminated\nSCSI Rate      : Ultra 320M SCSI\n\nVirtual Disks\nID                  : 0\nStatus              : Ok\nName                : Virtual Disk 0\nState               : Ready\nProgress            : Not Applicable\nLayout              : RAID-5\nSize                : 136.48 GB (146548981760 bytes)\nDevice Name         : /dev/sda\nType                : SCSI\nRead Policy         : Adaptive Read Ahead\nWrite Policy        : Write Back\nCache Policy        : Direct I/O\nStripe Element Size : 64 KB\nDisk Cache Policy   : \n\nPhysical Disks\nID                        : 0:0\nStatus                    : Ok\nName                      : Physical Disk 0:0\nState                     : Online\nFailure Predicted         : No\nProgress                  : Not Applicable\nType                      : SCSI\nCapacity                  : 68.24 GB (73274490880 bytes)\nUsed RAID Disk Space      : 68.24 GB (73274490880 bytes)\nAvailable RAID Disk Space : 0.00 GB (0 bytes)\nHot Spare                 : No\nVendor ID                 : SEAGATE \nProduct ID                : ST373207LC      \nRevision                  : D701\nSerial No.                : 3KT2NQDN\nNegotiated Speed          : 320\nCapable Speed             : 320\nManufacture Day           : Not Available\nManufacture Week          : Not Available\nManufacture Year          : Not Available\nSAS Address               : Not Available\n\nID                        : 0:1\nStatus                    : Ok\nName                      : Physical Disk 0:1\nState                     : Online\nFailure Predicted         : No\nProgress                  : Not Applicable\nType                      : SCSI\nCapacity                  : 68.24 GB (73274490880 bytes)\nUsed RAID Disk Space      : 68.24 GB (73274490880 bytes)\nAvailable RAID Disk Space : 0.00 GB (0 bytes)\nHot Spare                 : No\nVendor ID                 : SEAGATE \nProduct ID                : ST373207LC      \nRevision                  : D703\nSerial No.                : 3KT3ELLN\nNegotiated Speed          : 320\nCapable Speed             : 320\nManufacture Day           : Not Available\nManufacture Week          : Not Available\nManufacture Year          : Not Available\nSAS Address               : Not Available\n\nID                        : 0:2\nStatus                    : Ok\nName                      : Physical Disk 0:2\nState                     : Online\nFailure Predicted         : No\nProgress                  : Not Applicable\nType                      : SCSI\nCapacity                  : 68.24 GB (73274490880 bytes)\nUsed RAID Disk Space      : 68.24 GB (73274490880 bytes)\nAvailable RAID Disk Space : 0.00 GB (0 bytes)\nHot Spare                 : No\nVendor ID                 : SEAGATE \nProduct ID                : ST373207LC      \nRevision                  : D701\nSerial No.                : 3KT2PYK8\nNegotiated Speed          : 320\nCapable Speed             : 320\nManufacture Day           : Not Available\nManufacture Week          : Not Available\nManufacture Year          : Not Available\nSAS Address               : Not Available\n\nBattery\nID                        : 0\nStatus                    : Ok\nName                      : Battery 0\nState                     : Ready\nRecharge Count            : 1\nMax Recharge Count        : 1100\nPredicted Capacity Status : Not Applicable\nLearn State               : Not Applicable\nNext Learn Time           : Not Applicable\nMaximum Learn Delay       : Not Applicable\n\nEnclosure(s)\nID                    : 0\nStatus                : Ok\nName                  : Backplane\nState                 : Ready\nConnector             : 0\nTarget ID             : 6\nConfiguration         : Not Applicable\nFirmware Version      : 1.0 \nService Tag           : 54S1063\nAsset Tag             : Not Applicable\nAsset Name            : Not Applicable\nBackplane Part Number : Not Applicable\nSplit Bus Part Number : Not Applicable\nEnclosure Part Number : Not Applicable\nSAS Address           : Not Applicable\nEnclosure Alarm       : Not Applicable\n\n\n\n# List physical disks on controller 0\n# omreport storage pdisk controller=0\n\nList of Physical Disks on Controller PERC 4e/Di (Embedded)\n\nController PERC 4e/Di (Embedded)\nID                        : 0:0\nStatus                    : Ok\nName                      : Physical Disk 0:0\nState                     : Online\nFailure Predicted         : No\nProgress                  : Not Applicable\nType                      : SCSI\nCapacity                  : 68.24 GB (73274490880 bytes)\nUsed RAID Disk Space      : 68.24 GB (73274490880 bytes)\nAvailable RAID Disk Space : 0.00 GB (0 bytes)\nHot Spare                 : No\nVendor ID                 : SEAGATE \nProduct ID                : ST373207LC      \nRevision                  : D701\nSerial No.                : 3KT2NQDN\nNegotiated Speed          : 320\nCapable Speed             : 320\nManufacture Day           : Not Available\nManufacture Week          : Not Available\nManufacture Year          : Not Available\nSAS Address               : Not Available\n\n^ Top\nPrevious page: Check Dell RAID, Disks and Battery via SNMPNext page: Dell RAID Notes\n"}, {"name": "Windows úprava šňupaní", "date": "20.1.2021", "author": "admin", "url": "https://blog.iservery.com/2021/01/20/windows-uprava-snupani/", "content": "\nhttps://www.chip.cz/novinky/bezpecnejsi-windows-10-nastroj-wpd-vypne-cmuchani-operacniho-systemu/\n"}, {"name": "Cisco", "date": "30.12.2020", "author": "admin", "url": "https://blog.iservery.com/2020/12/30/cisco/", "content": "\nZdroj firmware\nhttps://cdn.cisko.dk/Misc/\n"}, {"name": "Manualy Proxmox", "date": "29.12.2020", "author": "admin", "url": "https://blog.iservery.com/2020/12/29/manualy-proxmox/", "content": "\nhttps://manualzz.com/doc/33630331/mastering-proxmox\n"}, {"name": "Dell R710 bios update", "date": "29.12.2020", "author": "admin", "url": "https://blog.iservery.com/2020/12/29/dell-r710-bios-update/", "content": "\nDownload R710-060600C.exe\nhttps://www.dell.com/support/home/cs-cz/drivers/driversdetails?driverid=0f4yy\nnainstalovat freedos z https://www.freedos.org/ \nna usb boot  pouzit treba rufus  https://rufus.ie/\npustit soubor s parametrem R710-060600C.exe /forcetype\n"}, {"name": "Jak na tvorbu web prezentace", "date": "15.12.2020", "author": "admin", "url": "https://blog.iservery.com/2020/12/15/jak-na-tvorbu-web-prezentace/", "content": "\nDohledový systém – že to pořád fungujenapř zabbix\nStatistika analýza zákazníku a jejich pohyb na webugoogle analyticshttps://github.com/bitnami/bitnami-docker-matomo nebo matomo GPL mnohem propracovanější\nUX jak na uživatelské rozhraní ilincev.com\npro inspiraci nic nedelaji ale penize sbiraji https://www.xixoio.com/o-nas/\n"}, {"name": "Zoneminder OpenAlpr", "date": "13.12.2020", "author": "admin", "url": "https://blog.iservery.com/2020/12/13/zoneminder-openalpr/", "content": "\nhttps://github.com/pliablepixels/zoneminder-docker/blob/master/zmeventnotification/objectconfig.ini\nhttps://groups.google.com/g/openalpr?pli=1\nhttps://zoneminder.miraheze.org/wiki/Zoneminder_with_plate_recognition\ndocker build -t openalpr https://github.com/mandza/openalpr.git\nwget https://rzauto.cz/wp-content/uploads/2020/04/0688_6.jpg\ndocker run -it –rm -v $(pwd):/data:ro openalpr -c eu 0699_6.jpg\n"}, {"name": "kuchyně a ložnice", "date": "5.11.2020", "author": "admin", "url": "https://blog.iservery.com/2020/11/05/kolecka-na-bar-kuchyne/", "content": "\nhttps://lednice.heureka.cz/samsung-brb260034ww/specifikace/#section\nhttps://mycky-nadobi.heureka.cz/aeg-fsb53927z/ koupeno\nhttps://www.kolapirkl.cz/nerez-nerez-nerez prumer 30mm\nhttps://www.kolapirkl.cz/kulickova-jednotka-alwayse-euro-530-0-14\nhttps://www.sezamcz.cz/stavece-dveri\nLožnice postele\nhttps://www.spime.cz/postel-z-masivu-gita\nhttps://www.spime.cz/postel-z-masivu-capri-dub-drasany\n\n"}, {"name": "Tastoma Sonoff roleta a autokonfigurace HA", "date": "1.11.2020", "author": "admin", "url": "https://blog.iservery.com/2020/11/01/tastoma-sonoff-roleta-a-autokonfigurace-ha/", "content": "\nNastaveni autokonfigurace pro firmware Tastoma  – SetOption19 1Přepnutí na rolety, žaluzie pro spinače se 2 rele –  SetOption80 1\nhttps://tasmota.github.io/docs/Blinds-and-Shutters/\nzákladní nastavení pro zaluzie somfy\nSetOption19 1SetOption80 1ShutterCloseDuration 45; ShutterOpenDuration 45;backlog interlock off; shutterrelay1 1; shuttersetclose1; interlock 1,2; interlock on; shutterrelay1 1; shutteropen1;\n\npravidla alias rules\nrule2 onrule2 on button1#state=3 do backlog power1 off; power2 off;power1 on; delay 1; power1 off; endon\nsetoption32 4 # long press after 4s\nswitchmode 5 # long press button\nrun as batch one line\nbacklog rule2 on; setoption32 4; switchmode 5; \nrule2 on button1#state=3 do backlog power1 off; power2 off;power1 on; delay 1; power1 off; endon; \n\nposlani mqtt publish \nbacklog rule2 on; setoption32 5; switchmode 5; \nrule2 on button1#state=3 do Publish 4relay/cmd GPIO,12,1 endon\n\n"}, {"name": "Festo – Motion terminal VTEM – základy", "date": "22.10.2020", "author": "admin", "url": "https://blog.iservery.com/2020/10/22/festo-motion-terminal-vtem-zaklady/", "content": "\nfesto.cz nutné utility\nVyhledavani a nastaveni IP adres terminálu – SW –  FFT  Festo field device tools odkaz\nCodesys provided by Festo odkaz \ndo Codesysu pridat knihovny a package pro ovladani modulu \n– VTEM = blok s ventily – ovladač zde\n– package pro CPX-CEC = plc procesor  – ovladač zde\nPo nastartovani CODESYSU – instalace nahrat CPX-CEC package a knihovnu VTEM\n\n"}, {"name": "Nákup HW ze zahraničí", "date": "14.10.2020", "author": "admin", "url": "https://blog.iservery.com/2020/10/14/nakup-hw-ze-zahranici/", "content": "\nhttps://www.2nd-source.de\nSwitche kably karty Server\nBrocade 1.0m 40G QSFP\nBrocade 24x RJ-45 10/100/1000Base-T 8x SFP 4x QSFP Switch ICX6610-24P\n\n\n"}, {"name": "Esp32 BLE Xiaomi temperature humidity sensor LYWSD03MMC", "date": "14.5.2020", "author": "admin", "url": "https://blog.iservery.com/2020/05/14/esp32-ble-xiaomi-temperature-humidity-sensor-lywsd03mmc/", "content": "\nhttps://github.com/AnthonyKNorman/Xiaomi_LYWSD03MMC_for_HA\n"}, {"name": "oprava site IT4", "date": "6.5.2020", "author": "admin", "url": "https://blog.iservery.com/2020/05/06/oprava-site-it4/", "content": "\nna routeru, kde je NATaccess-list 1 permit 192.168.0.0 0.0.252.0\nzmeneno na \naccess-list 1 permit 192.168.0.0 0.0.3.255\nip route 0.0.0.0 0.0.0.0 213.155.255.1\nzmeneno na \nip route 0.0.0.0 0.0.0.0 213.155.225.1\nopraveno ospf,dhcp,acl,lacp,sshStáhnout\nospf,dhcp,acl,lacp,sshStáhnout\n"}, {"name": "Instalace wordpress na Ubuntu 18.04", "date": "27.4.2020", "author": "admin", "url": "https://blog.iservery.com/2020/04/27/instalace-wordpress-na-ubuntu-18-04/", "content": "\nmusite si nainstalovat phpmyadmin a mysql server odkaz\ndale pokracovat podle videa\n\n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\n\n"}, {"name": "Ukázkový příklad maturitní práce Cisco – dynamický routing", "date": "25.4.2020", "author": "admin", "url": "https://blog.iservery.com/2020/04/25/ukazkovy-priklad-maturitni-prace-cisco-dynamicky-routing/", "content": "\nPraktický příklad k přípravě odkazVidea k příkladu \n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\n\n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\nSplněný příklad odkaz\n\n"}, {"name": "Ukázka maturitního příkladu Cisco – statický routing", "date": "25.4.2020", "author": "admin", "url": "https://blog.iservery.com/2020/04/25/ukazka-maturitniho-prikladu-cisco-staticky-routing/", "content": "\nZadání práce – odkazVyřešený příklad – odkazŘešení video\n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\n\n\n"}, {"name": "Micropython  + LoRa WAN", "date": "6.4.2020", "author": "admin", "url": "https://blog.iservery.com/2020/04/06/micropython-lora-wan/", "content": "\nhttps://lemariva.com/blog/2020/03/m5stack-atom-lorawan-node-running-micropython\nhttps://github.com/hiveeyes/terkin-datalogger\nhttps://ttnmapper.org/alpha-shapes/\n"}, {"name": "Instalace Micropython a Vscode", "date": "6.4.2020", "author": "admin", "url": "https://blog.iservery.com/2020/04/06/instalace-micropython-a-vscode/", "content": "\nInstalace vscode https://linuxize.com/post/how-to-install-visual-studio-code-on-ubuntu-18-04/\nsudo apt update\nsudo apt install software-properties-common apt-transport-https wget\nwget -q https://packages.microsoft.com/keys/microsoft.asc -O- | sudo apt-key add –\nsudo add-apt-repository „deb [arch=amd64] https://packages.microsoft.com/repos/vscode stable main“\nsudo apt update\nsudo apt install code\nInstalace pluginu vscode –  https://lemariva.com/blog/2018/12/micropython-visual-studio-code-as-ide instalace pymakr instalace esptools.py node.js \nInstalace micropython na device esp32 nebo esp8266\nhttps://lemariva.com/blog/2020/03/tutorial-getting-started-micropython-v20\nnásledně připojení na konzoli esp32\n"}, {"name": "Video Cisco ssh + ACL", "date": "10.2.2020", "author": "admin", "url": "https://blog.iservery.com/2020/02/10/video-cisco-ssh-acl/", "content": "\n\n\nPlease enable JavaScriptplay-sharp-fill\n\n\n\nLinkEmbedCopy and paste this HTML code into your webpage to embed.\n\n\nCisco Lekce 1\n\n"}]